# Operations on  Pandas DataFrame

## Import the library

In [37]:
import pandas as pd

## Create a Pandas DataFrame

In [12]:
df=pd.DataFrame({'Dates' :[None, '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06'] ,\
                'ID': [1,2,3,4,5,6],\
                'Names':['A','B',None,'D','E','F'],\
                'Designation':['Manager','Employee',None,'CTO','Manager','Employee']})
df

        Dates  ID Names Designation
0        None   1     A     Manager
1  2020-01-02   2     B    Employee
2  2020-01-03   3  None        None
3  2020-01-04   4     D         CTO
4  2020-01-05   5     E     Manager
5  2020-01-06   6     F    Employee

## Copy a Pandas DataFrame

In [13]:
df2=df.copy()
df2

        Dates  ID Names Designation
0        None   1     A     Manager
1  2020-01-02   2     B    Employee
2  2020-01-03   3  None        None
3  2020-01-04   4     D         CTO
4  2020-01-05   5     E     Manager
5  2020-01-06   6     F    Employee

## Drop Missing Values in Pandas DataFrame

In [14]:
df2.dropna()

        Dates  ID Names Designation
1  2020-01-02   2     B    Employee
3  2020-01-04   4     D         CTO
4  2020-01-05   5     E     Manager
5  2020-01-06   6     F    Employee

## Fill Missing Values in Pandas DataFrame

In [16]:
df2.fillna('NULL')

        Dates  ID Names Designation
0        NULL   1     A     Manager
1  2020-01-02   2     B    Employee
2  2020-01-03   3  NULL        NULL
3  2020-01-04   4     D         CTO
4  2020-01-05   5     E     Manager
5  2020-01-06   6     F    Employee

## Calculating Mean in Pandas DataFrame

In [18]:
df2['ID'].mean()

3.5

## Count Function in Pandas DataFrame

In [25]:
df2.count()

Dates          5
ID             6
Names          5
Designation    5
dtype: int64

## Applying a Lambda Function on a column

In [23]:
df2['ID'].apply(lambda x:x+10)

0    11
1    12
2    13
3    14
4    15
5    16
Name: ID, dtype: int64

## Grouping in Pandas DataFrame

In [29]:
df2.groupby('Designation').sum().reset_index()

  Designation  ID
0         CTO   4
1    Employee   8
2     Manager   6

## Sorting in Pandas DataFrame

In [35]:
df2.sort_values(by=['Designation'])

        Dates ID Names Designation
3  2020-01-04  4     D         CTO
1  2020-01-02  2     B    Employee
5  2020-01-06  6     F    Employee
0        None  1     A     Manager
4  2020-01-05  5     E     Manager
2  2020-01-03  3  None        None

## Type Casting in Pandas DataFrame

In [33]:
df2['ID'].astype(str)

0    1
1    2
2    3
3    4
4    5
5    6
Name: ID, dtype: object

## Renaming a Column

In [36]:
df.rename(columns={'Names':'Levels'})

        Dates  ID Levels Designation
0        None   1      A     Manager
1  2020-01-02   2      B    Employee
2  2020-01-03   3   None        None
3  2020-01-04   4      D         CTO
4  2020-01-05   5      E     Manager
5  2020-01-06   6      F    Employee